In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Displaying first & last three rows
***

In [3]:
print(df1.head(3))
print()
print(df1.tail(3))

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Checking shape of our dataset
***

In [4]:
df1.shape

(7, 3)

# getting more info about our dataset
***

In [5]:

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# Checking Null Values in any Dataset
***

In [6]:
df1.isnull() # returns boolean output

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [7]:
df1.isnull().sum() # returns total number of null values in each column

Name      0
Marks     0
Gender    0
dtype: int64

In [8]:
df1.isnull().sum(axis=1) # returns total number of null values in each row

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# Getting overall Statistic info about data set
***

In [9]:
stats=df1.describe()
stats

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

# Unique values from gender column
***

In [10]:
df1["Gender"].unique() # only two values, male & female , are repeating

array(['Male', 'Female'], dtype=object)

In [11]:
df1["Gender"].nunique()

2

In [12]:
# Counting total number of unique values i.e no. of males & females

df1["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

# Finding total number of students having marks b/w 90 & 100
***

**Students having marks greater than 90 and equal to 100**

In [13]:
pss=df1["Marks"]>=90

df1[pss]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [14]:
df1[(df1["Marks"]>=90)  & (df1["Marks"]>=90)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

**Now, counting them**

In [16]:
len(df1[(df1["Marks"]>=90)  & (df1["Marks"]>=90)])

4

# Using between method
***

In [18]:
df1["Marks"].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [20]:
df1[df1["Marks"].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [21]:
len(df1[df1["Marks"].between(90,100)])

4

# Using methods i.e min, max, mean etc of marks
***

In [25]:
df1["Marks"]

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [22]:
df1["Marks"].mean()

92.14285714285714

In [24]:
df1["Marks"].min()

83

In [26]:
df1["Marks"].max()

99

In [28]:
df1["Marks"].avg()

AttributeError: 'Series' object has no attribute 'avg'